{
  "id": "terms-random",
  "title": "랜덤 경제용어 조회",
  "description": "무작위로 선택된 경제용어를 조회합니다. 학습 목적으로 다양한 용어를 접할 수 있도록 제공됩니다.",
  "method": "GET",
  "endpoint": "/api/terms/random",
  "headers": [
    {
      "name": "Accept",
      "value": "application/json",
      "required": false,
      "description": "응답 형식 지정"
    }
  ],
  "parameters": [
    {
      "name": "count",
      "type": "integer",
      "required": false,
      "description": "조회할 랜덤 용어 개수 5개"
    }
  ],
  "requestExample": null,
  "responses": [
    {
      "status": "200 OK",
      "description": "랜덤 경제용어 조회 성공"
    },
    {
      "status": "400 Bad Request",
      "description": "잘못된 파라미터 값"
    },
    {
      "status": "500 Internal Server Error",
      "description": "서버 오류 발생"
    }
  ],
  "responseExample": {
    "requestedCount": 5,
    "data": [
      {
        "id": 1347,
        "keyword": "경제",
        "title": "투자협정",
        "definition": "두 개 이상의 국가가 서로간의 투자증진 및 투자보호를 목적으로 체결하는 협정. 두 개의 국가간에 이루어지는 협정을 양자간 투자협정, 다수의 국가간에 이루어지는 협정을 다자간 투자협정이라고 한다. 또한 지역경제 통합체에 속하는 국가들 간에 투자협정이 체결되기도 하며, 이는 지역투자협정 또는 복수 국가간 투자협정이라 할 수 있다. 지역투자협정으로는 북미자유무역협정(NAFTA: North American Free Trade Agreement)이 대표적이다. 양자간 투자협정의 가장 핵심적인 내용은 외국인투자자의 재산 보호에 있다. 투자자의 입장에서 볼 때 해외투자는 여러 가지 위험요소를 안고 있다. 사업상의 위험(상업적 위험)은 어쩔 수 없이 감당해야 할 부분이라 하겠지만, 비상업적 위험은 일국의 조치(현지국의 보호조치 또는 투자국의 보장조치) 또는 양국간의 공동보장 등에 의해 상당히 경감될 수 있다. 양자간 투자협정은 체약당사국들 간의 공동보장을 통해 비상업적 위험으로부터 투자자를 보호하는 법적 장치를 마련하는 데 그 주된 목적이 있다. 양자간 투자협정은 투자국의 입장에 있는 한 국가와 투자 유치국의 입장에 있는 한 국가 간에 체결되는 것이 일반적이다. 투자국의 입장에서 양자간 투자협정을 체결하는 이유는 자국의 투자 및 투자자에 대한 보호와 현지에서 자유로운 활동을 보장하기 위해서이고, 투자 유치국의 입장에서는 외국인투자 유치를 확대하기 위해서다."
      },
      {
        "id": 1348,
        "keyword": "경제",
        "title": "투자활동지표",
        "definition": "한 나라 경제의 투자활동이 어느 정도인가를 파악하는 지표를 말한다. 크게 설비투자지표와 건설투자지표로 나뉜다. 투자활동지표는 주로 미래의 경기추세를 판단하는 선행지표로 활용된다. 우리나라에서는 통계청이 매달 발표하는 투자활동지표와 한국은행이 분기별로 발표하는 국민계정상의 투자활동지표가 있다. 통계청이 발표하는 투자활동지표는 설비부문 지표와 건설부문 지표로 구성된다. 설비투자 부문에는 설비투자추계, 기계류 수입액, 설비용기계 내수출하, 국내 기계수주액 등의 지표가 포함된다. 또 건설투자 부문에는 건설기성액, 국내 건설수주, 건축허가면적 등이 포함된다. 설비투자지표 중 설비투자추계는 설비투자재의 월별 국내 생산과 수입액 중에서 수출과 중간수요 등을 차감해 설비투자의 순국내 공급규모를 추정한 것이다. 국내 기계수주는 설비용기계류 수주액을 기종과 발주자별로 조사해 산출하며 경기선행지수의 구성항목으로 사용된다."
      },
      {
        "id": 1349,
        "keyword": "금융",
        "title": "트레이너지수",
        "definition": "시장위험에 대한 초과 수익률 정도를 나타내는 지수로 펀드위험지표의 하나다. 위험 조정 성과로 가장 많이 이용되는 샤프지수가 위험에 대한 초과수익률 정도를 나타낸 것이라면 트레이너지수는 시장 민감도를 나타내는 베타지수로 초과수익률을 나눈 것이다. 특히, 포트폴리오가 잘 분산되어 있는 펀드를 평가할 때 적합하다."
      },
      {
        "id": 1350,
        "keyword": "금융",
        "title": "트리플 강세",
        "definition": "금융시장에서 쓰이는 용어로 주가가 상승하면서 원화강세와 채권가격도 상승(금리하락)하는 현상을 말한다. 트리플 강세가 나타나는 이유는 우리나라의 경우 특히 주가와 환율이 밀접한 관계를 보이기 때문이다. 외국인투자자들이 한국주식을 많이 매수하면서 주가가 상승할 가능성이 많아진다. 외국인의 투자 증가로 달러화가 외환시장에 많이 들어오면 원화가치는 상승(원달러 환율은 하락)하게 되고 이로 인해 풍부해진 유동성 때문에, 또는 다른 요인으로 시장에 채권수요가 늘어난 경우 채권값까지 상승(금리는 하락)하게 된다. 이와 반대로, 주식시장과 채권시장에서 빠져 나온 자금이 해외로 유출돼 환율, 주가, 채권가격이 동시에 하락하는 현상을 ‘트리플 약세’라고 한다. 트리플 약세는 ‘주가하락, 환율상승(원화가치 하락), 금리상승(채권값 하락)’이 맞물린 경우이다."
      },
      {
        "id": 1351,
        "keyword": "경제",
        "title": "트리핀의 딜레마(Triffin's Dilemma)",
        "definition": "기축통화 발행국은 기축통화의 국제 유동성을 유지하기 위해 국제수지(경상수지) 적자를 지속해야 하는데 이는 기축통화에 대한 신뢰도 하락으로 연결될 수밖에 없다는 상충관계."
      }
    ],
    "success": true,
    "returnedCount": 5,
    "message": "랜덤 용어 조회가 완료되었습니다."
  },
  "curlExample": "curl -X GET \"http://localhost:8080/api/terms/random\""
}
